'use strict';

//Task# 1

//Что вернут следующие строки кода?
// Boolean(Number(’10’)) + 1;
// ‘sub ’ + Number(false);
// 16  *  ‘      91    ‘
// true-70
// Number(1 + String(1)) + 1
console.log(Boolean(Number('10')) + 1);
// 2 - томущо с першу перетворює строку '10' у число 10 , потім число 10 на булюве значення 10 це true а це у булювем значенні 1, а 1+1=2
console.log('sub' + Number(false));
// sub0 - томущо false у числовому значенні це 0, а додавання до строки числа це обєднання в одну строку.
console.log(16 * '      91    ');
// 1456 - томущо при матиматичних діях числа та строки (крім +) строка неявно перетворюєтся на число і якщо строка мала пробіли вони зникають.
console.log(true - 70);
// -69 - томущо при матиматичних діях числа та булювого значення, булювого значення неявно перетворюєтся на число а true це 1 а 1-70 це -69.
console.log(Number(1 + String(1)) + 1);
// 12 - томущо сперше перетворюється 1 на строку '1' потім іде додавання числа до строки а це буде строка тому маємо '11', потім функція number() перетворює строку '11' у чіслове значення 11, а 11+1=12.

// Task# 2

let hours = +prompt('Add hours');
let seconds = hours * 60;
alert(`${seconds} seconds in ${hours} hours`);

// Task #3

let num = 1;
num += 12;
num -= 14;
num *= 5;
num /= 7;
num += 1;
num -= 1;
alert(num);